// eslint-disable-next-line no-unused-vars
import React, { useState } from 'react'
import CssHome from "../Home/Home.module.css";
import Time from '../time/Time';


export default function Home() {


  return (

    <>

    <div className={`text-white vh-100 text-center flex-column d-flex justify-content-center align-items-center ${CssHome.home}`}>


    <div className=" py-3 pe-2">
        <h2>مرحبا بك في</h2>
        <h2>موقع <span className="qurank fs-1">قرآنك</span> الأسلامي</h2>
        <div className="py-5">
        <a href="#salat">
          <button className="btn btn-outline-light px-4 fs-4"> <i className="fa fa-clock"></i> مواقيت الصلاة</button>
        </a>
        </div>


    </div>



    </div>

    <div className="my-3 shadow-lg">
      <div className="container text-center py-5">
        <div>

          <h2 className="pb-5">
           ` هذا الموقع تم تصميمة ليكون صدقة جارية لجميع أموات المسلمين
`          </h2>
          <h3>
              ``  اللهمّ اجزهم عن الإحسان إحسانًا، وعن الإساءة عفوًا وغفرانًا. اللهم اغفر لهم وعافهم واعف عنهم، وأكرم نزلهم، ووسع مدخلهم، واغسلهم بالماء والثلج والبرد، ونقهم من الذنوب كما ينقى الثوب الأبيض من الدنس. اللهمّ إنّهم نَزَلوا بك وأنت خير منزولٍ به، وأصبحوا فقراء إلى رحمتك، وأنت غنيٌّ عن عذابههم. اللهمّ افسح لهم في قبورهم مدّ بصرهم، وافرش لهم فى قبورهم من فراش الجنّة واطعمهم من طعام الجنة واللبسهم من لباس الجنة. اللهمّ آتهم برحمتك ورضاك، وقهِم فتنة القبر وعذابه، وآتهم برحمتك الأمن من عذابك حتّى تبعثهم إلى جنّتك يا أرحم الرّاحمين. اللهمّ اغفرلهم تحت الارض، واسترههم يوم العرض، ولا تخزهم يوم يبعثون “يوم لا ينفع مالٌ ولا بنون إلّا من أتى الله بقلبٍ سليم. اللهم آنس وحدتهم، وآنسهم في وحشتهم، وارحم في غربتهم، اللهم أنزلهم منزلًا منزلًا مباركًا، وأنت خير المنزلين، وأنزلهم منازل الشهداء والصديقين، وحسن أولئك رفيقًا. اللهم اغفر لهم وارفع درجتهم في المهديين، وافسح لهم قبورهم، وانر لهم نورا من نورك فى قبورهم، واجعل قبورهم روضة من رياض الجنة، واغفر لنا ولهم يا أرحم الراحمين. اللهم اجعل قبورهم روضة من رياض الجنة، ولا تجعله حفرة من حفر النار، اللهم افسح لهم في قبورهم مد ابصارهم، وافرش قبرهم من فراش الجنة. اللهم قهم من عذاب القبر، وجفاف الأرض على جنبيهم، واملًا قبورهم بالرضا والنور، والفسحة والسرور. اللهم إن عبادك في ذمتك وحبل جوارك، فقهم فتنة القبر، وعذاب النار، وأنت أهل الوفاء والحق، فاغفر لهم وارحمهم، إنك أنت الغفور الرحيم. اللهمّ ادخلهم الجنّة من غير سابقة عذاب ولا عقاب . اللهم صل على  سيدنامحمد وعلى آل سيدنا محمد، كما صليت على  سيدناإبراهيم، وعلى آل سيدنا إبراهيم، و بارك على سيدنا محمد، وعلى آل سيدنا محمد، كما باركت على سيدنا إبراهيم، وعلى آل سيدنا إبراهيم فى العالمين، إنك حميد مجيد 
       ``   </h3>
        </div>
      </div>
    </div>
    <Time />





    
    
    
    
    
    
    </>

  )
}
